alibaba/AliOS-Things/platform/mcu/nrf52xxx/Drivers/proprietary_rf/esb/nrf_esb.c
    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_BASE0);

    return apply_address_workarounds();
}


uint32_t nrf_esb_set_base_address_1(uint8_t const * p_addr)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_addr);
    
    /*
    Workaround for nRF52832 Rev 1 Errata 107
    Check if pipe 0 or pipe 1-7 has a 'zero address'.
    Avoid using access addresses in the following pattern (where X is don't care): 
    ADDRLEN=5 
    BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

    ADDRLEN=4 
    BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
    */
    uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
    if((addr_conv(p_addr) & base_address_mask) == 0 && ((NRF_RADIO->PREFIX0 & 0x0000FF00) == 0 ||(NRF_RADIO->PREFIX0 & 0x00FF0000) == 0 || (NRF_RADIO->PREFIX0 & 0xFF000000) == 0 ||
       (NRF_RADIO->PREFIX1 & 0xFF000000) == 0 || (NRF_RADIO->PREFIX1 & 0x00FF0000) == 0 ||(NRF_RADIO->PREFIX1 & 0x0000FF00) == 0 || (NRF_RADIO->PREFIX1 & 0x000000FF) == 0))
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    
    memcpy(m_esb_addr.base_addr_p1, p_addr, 4);

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_BASE1);

    return apply_address_workarounds();
}


uint32_t nrf_esb_set_prefixes(uint8_t const * p_prefixes, uint8_t num_pipes)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_PARAM_NOT_NULL(p_prefixes);
    VERIFY_TRUE(num_pipes < 9, NRF_ERROR_INVALID_PARAM);
    
    /*
    Workaround for nRF52832 Rev 1 Errata 107
    Check if pipe 0 or pipe 1-7 has a 'zero address'.
    Avoid using access addresses in the following pattern (where X is don't care): 
    ADDRLEN=5 
    BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

    ADDRLEN=4 
    BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
    */
    uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
    if(num_pipes >= 1 && (NRF_RADIO->BASE0 & base_address_mask) == 0 && p_prefixes[0] == 0)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if((NRF_RADIO->BASE1 & base_address_mask) == 0)
    {
        for (uint8_t i = 1; i < num_pipes; i++)
        {
            if (p_prefixes[i] == 0)
            {
                return NRF_ERROR_INVALID_PARAM;
            }
        }
    }
    
    memcpy(m_esb_addr.pipe_prefixes, p_prefixes, num_pipes);
    m_esb_addr.num_pipes = num_pipes;
    m_esb_addr.rx_pipes_enabled = BIT_MASK_UINT_8(num_pipes);

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_PREFIX);

    return apply_address_workarounds();
}


uint32_t nrf_esb_update_prefix(uint8_t pipe, uint8_t prefix)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(pipe < 8, NRF_ERROR_INVALID_PARAM);
    
    /*
    Workaround for nRF52832 Rev 1 Errata 107
    Check if pipe 0 or pipe 1-7 has a 'zero address'.
    Avoid using access addresses in the following pattern (where X is don't care): 
    ADDRLEN=5 
    BASE0 = 0x0000XXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x0000XXXX, PREFIX1 = 0x00XXXXXX 

    ADDRLEN=4 
    BASE0 = 0x00XXXXXX, PREFIX0 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX0 = 0x00XXXXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXXXX00 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXXXX00XX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0xXX00XXXX 
    BASE1 = 0x00XXXXXX, PREFIX1 = 0x00XXXXXX
    */
    uint32_t base_address_mask = m_esb_addr.addr_length == 5 ? 0xFFFF0000 : 0xFF000000;
    if (pipe == 0)
    {
        if((NRF_RADIO->BASE0 & base_address_mask) == 0 && prefix == 0)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
    else{
        if((NRF_RADIO->BASE1 & base_address_mask) == 0 && prefix == 0)
        {
            return NRF_ERROR_INVALID_PARAM;
        }
    }
    
    m_esb_addr.pipe_prefixes[pipe] = prefix;

    update_radio_addresses(NRF_ESB_ADDR_UPDATE_MASK_PREFIX);

    return apply_address_workarounds();
}


uint32_t nrf_esb_enable_pipes(uint8_t enable_mask)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    m_esb_addr.rx_pipes_enabled = enable_mask;

    return apply_address_workarounds();
}


uint32_t nrf_esb_set_rf_channel(uint32_t channel)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(channel <= 100, NRF_ERROR_INVALID_PARAM);

    m_esb_addr.rf_channel = channel;

    return NRF_SUCCESS;
}


uint32_t nrf_esb_get_rf_channel(uint32_t * p_channel)
{
    VERIFY_PARAM_NOT_NULL(p_channel);

    *p_channel = m_esb_addr.rf_channel;

    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_tx_power(nrf_esb_tx_power_t tx_output_power)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    if ( m_config_local.tx_output_power != tx_output_power )
    {
        m_config_local.tx_output_power = tx_output_power;
        update_radio_tx_power();
    }

    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_retransmit_delay(uint16_t delay)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(delay >= NRF_ESB_RETRANSMIT_DELAY_MIN, NRF_ERROR_INVALID_PARAM);

    m_config_local.retransmit_delay = delay;
    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_retransmit_count(uint16_t count)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    m_config_local.retransmit_count = count;
    return NRF_SUCCESS;
}


uint32_t nrf_esb_set_bitrate(nrf_esb_bitrate_t bitrate)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);

    m_config_local.bitrate = bitrate;
    return update_radio_bitrate() ? NRF_SUCCESS : NRF_ERROR_INVALID_PARAM;
}


uint32_t nrf_esb_reuse_pid(uint8_t pipe)
{
    VERIFY_TRUE(m_nrf_esb_mainstate == NRF_ESB_STATE_IDLE, NRF_ERROR_BUSY);
    VERIFY_TRUE(pipe < 8, NRF_ERROR_INVALID_PARAM);

    m_pids[pipe] = (m_pids[pipe] + NRF_ESB_PID_MAX) % (NRF_ESB_PID_MAX + 1);
    return NRF_SUCCESS;
}


// Handler for 
#ifdef NRF52
void NRF_ESB_BUGFIX_TIMER_IRQHandler(void)
{
    if(NRF_ESB_BUGFIX_TIMER->EVENTS_COMPARE[0])
    {
        NRF_ESB_BUGFIX_TIMER->EVENTS_COMPARE[0] = 0;

        // If the timeout timer fires and we are in the PTX receive ACK state, disable the radio
        if(m_nrf_esb_mainstate == NRF_ESB_STATE_PTX_RX_ACK)
        {
            NRF_RADIO->TASKS_DISABLE = 1;
        }
    }
}
#endif
